In [2]:
# Install (only once in your system)
# pip install pandas

import pandas as pd

# Check version
print(pd.__version__)

2.3.1

In [1]:
import pandas as pd

a = [10, 20, 30]
s = pd.Series(a)
print(s)

0    10
1    20
2    30
dtype: int64

In [3]:
s = pd.Series([10, 20, 30], index=["x", "y", "z"])
print(s["y"])   # Access using label

20

In [4]:
calories = {"day1": 420, "day2": 380, "day3": 390}
s = pd.Series(calories)
print(s)

day1    420
day2    380
day3    390
dtype: int64

In [6]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [8]:
print(df.loc[0])       # First row

calories    420
duration     50
Name: 0, dtype: int64

In [9]:
print(df.loc[[0,1]])   # First 2 rows

   calories  duration
0       420        50
1       380        40

In [11]:
df = pd.DataFrame(data, index=["day1", "day2", "day3"])
print(df)
print(df.loc["day2"])  # Access row by label

      calories  duration
day1       420        50
day2       380        40
day3       390        45
calories    380
duration     40
Name: day2, dtype: int64

In [3]:
import pandas as pd

df=pd.read_csv("sample_employee.csv")
print(df.head())

      Name  Age Department  Salary  Joining_Year
0    Alice   25         HR   50000          2020
1      Bob   30         IT   60000          2018
2  Charlie   35    Finance   75000          2015
3    David   40         IT   80000          2019
4      Eva   29    Finance   58000          2021

In [13]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          10 non-null     object
 1   Age           10 non-null     int64
 2   Department    10 non-null     object
 3   Salary        10 non-null     int64
 4   Joining_Year  10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes
None

In [14]:
print(df.describe())

             Age        Salary  Joining_Year
count  10.000000     10.000000     10.000000
mean   31.400000  65700.000000   2018.500000
std     4.599517   8807.194029      2.173067
min    25.000000  50000.000000   2015.000000
25%    28.250000  60500.000000   2017.250000
50%    30.500000  65500.000000   2018.500000
75%    34.500000  71250.000000   2019.750000
max    40.000000  80000.000000   2022.000000

In [15]:
print(df["Salary"].mean())

65700.0

In [16]:
print(df.corr())

ValueError: could not convert string to float: 'Alice'

In [17]:
print(df.corr(numeric_only=True))

                   Age    Salary  Joining_Year
Age           1.000000  0.746613     -0.455781
Salary        0.746613  1.000000     -0.467350
Joining_Year -0.455781 -0.467350      1.000000

In [18]:
print(df.groupby("Department")["Salary"].mean())

Department
Finance    68500.000000
HR         59666.666667
IT         68000.000000
Name: Salary, dtype: float64

In [19]:
print(df[df["Age"] > 30])

      Name  Age Department  Salary  Joining_Year
2  Charlie   35    Finance   75000          2015
3    David   40         IT   80000          2019
5    Frank   33         HR   62000          2017
6    Grace   31    Finance   72000          2016
8      Ian   36         HR   67000          2018

In [20]:
print(df[df["Age"] > 30]["Name"])

2    Charlie
3      David
5      Frank
6      Grace
8        Ian
Name: Name, dtype: object

In [21]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ian
9       Jack
Name: Name, dtype: object

In [4]:
print(df.values)

[['Alice' 25 'HR' 50000 2020]
 ['Bob' 30 'IT' 60000 2018]
 ['Charlie' 35 'Finance' 75000 2015]
 ['David' 40 'IT' 80000 2019]
 ['Eva' 29 'Finance' 58000 2021]
 ['Frank' 33 'HR' 62000 2017]
 ['Grace' 31 'Finance' 72000 2016]
 ['Hannah' 28 'IT' 64000 2022]
 ['Ian' 36 'HR' 67000 2018]
 ['Jack' 27 'Finance' 69000 2019]]

In [5]:
df.sort_values(by="Age")

      Name  Age Department  Salary  Joining_Year
0    Alice   25         HR   50000          2020
9     Jack   27    Finance   69000          2019
7   Hannah   28         IT   64000          2022
4      Eva   29    Finance   58000          2021
1      Bob   30         IT   60000          2018
6    Grace   31    Finance   72000          2016
5    Frank   33         HR   62000          2017
2  Charlie   35    Finance   75000          2015
8      Ian   36         HR   67000          2018
3    David   40         IT   80000          2019

In [6]:
df.sort_values(by=["Age","Salary"],ascending=False)

      Name  Age Department  Salary  Joining_Year
3    David   40         IT   80000          2019
8      Ian   36         HR   67000          2018
2  Charlie   35    Finance   75000          2015
5    Frank   33         HR   62000          2017
6    Grace   31    Finance   72000          2016
1      Bob   30         IT   60000          2018
4      Eva   29    Finance   58000          2021
7   Hannah   28         IT   64000          2022
9     Jack   27    Finance   69000          2019
0    Alice   25         HR   50000          2020

In [7]:
print(df.loc[4:8, ["Age", "Salary"]])

   Age  Salary
4   29   58000
5   33   62000
6   31   72000
7   28   64000
8   36   67000

In [12]:
print(df.iloc[4:8, 1:4])

   Age Department  Salary
4   29    Finance   58000
5   33         HR   62000
6   31    Finance   72000
7   28         IT   64000

In [15]:
print(df.loc[[6, 9], ["Age", "Salary"]])

   Age  Salary
6   31   72000
9   27   69000

In [17]:
df.sort_values(by=["Salary"],ascending=False).head(3)

      Name  Age Department  Salary  Joining_Year
3    David   40         IT   80000          2019
2  Charlie   35    Finance   75000          2015
6    Grace   31    Finance   72000          2016

In [18]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [27]:
df1=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
df2=pd.DataFrame({'c':[4,5,6],'d':[7,8,9]})
pd.concat([df1,df2],axis=0,ignore_index=True)


# print(df1)

     a    b    c    d
0  1.0  4.0  NaN  NaN
1  2.0  5.0  NaN  NaN
2  3.0  6.0  NaN  NaN
3  NaN  NaN  4.0  7.0
4  NaN  NaN  5.0  8.0
5  NaN  NaN  6.0  9.0

In [29]:
df1=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
df2=pd.DataFrame({'c':[4,5,6],'b':[4,5,6]})
df1.merge(df2)

   a  b  c
0  1  4  4
1  2  5  5
2  3  6  6